NewNoob2002/hc32f460xe_gcc/user/src/MYSPI.cpp
#include "LCD.h"
#include <hc32_ddl.h>

#include "MYSPI.h"
void Spi_Config(void)
{
  LCD_Control_Init();
  stc_spi_init_t stcSpiInit;
  /* configuration structure initialization */
  MEM_ZERO_STRUCT(stcSpiInit);

  /* Configuration peripheral clock */
  PWC_Fcg1PeriphClockCmd(SPI_UNIT_CLOCK, Enable);

  /* Configuration SPI pin */
  PORT_SetFunc(SPI_SCK_PORT, SPI_SCK_PIN, SPI_SCK_FUNC, Disable);
  PORT_SetFunc(SPI_NSS_PORT, SPI_NSS_PIN, SPI_NSS_FUNC, Disable);
  PORT_SetFunc(SPI_MOSI_PORT, SPI_MOSI_PIN, SPI_MOSI_FUNC, Disable);
  PORT_SetFunc(SPI_MISO_PORT, SPI_MISO_PIN, SPI_MISO_FUNC, Disable);

  /* Configuration SPI structure */
  stcSpiInit.enClkDiv = SpiClkDiv2; // SpiClkDiv64;
  stcSpiInit.enFrameNumber = SpiFrameNumber1;
  stcSpiInit.enDataLength = SpiDataLengthBit8;
  stcSpiInit.enFirstBitPosition = SpiFirstBitPositionMSB;
  stcSpiInit.enSckPolarity = SpiSckIdleLevelLow;
  stcSpiInit.enSckPhase = SpiSckOddSampleEvenChange;
  stcSpiInit.enReadBufferObject = SpiReadReceiverBuffer;
  stcSpiInit.enWorkMode = SpiWorkMode4Line;
  stcSpiInit.enTransMode = SpiTransFullDuplex;
  stcSpiInit.enCommAutoSuspendEn = Disable;
  stcSpiInit.enModeFaultErrorDetectEn = Disable;
  stcSpiInit.enParitySelfDetectEn = Disable;
  stcSpiInit.enParityEn = Disable;
  stcSpiInit.enParity = SpiParityEven;

  stcSpiInit.enMasterSlaveMode = SpiModeMaster;
  stcSpiInit.stcDelayConfig.enSsSetupDelayOption = SpiSsSetupDelayCustomValue;
  stcSpiInit.stcDelayConfig.enSsSetupDelayTime = SpiSsSetupDelaySck1;
  stcSpiInit.stcDelayConfig.enSsHoldDelayOption = SpiSsHoldDelayCustomValue;
  stcSpiInit.stcDelayConfig.enSsHoldDelayTime = SpiSsHoldDelaySck1;
  stcSpiInit.stcDelayConfig.enSsIntervalTimeOption = SpiSsIntervalCustomValue;
  stcSpiInit.stcDelayConfig.enSsIntervalTime = SpiSsIntervalSck6PlusPck2;
  stcSpiInit.stcSsConfig.enSsValidBit = SpiSsValidChannel0;
  stcSpiInit.stcSsConfig.enSs0Polarity = SpiSsLowValid;

  SPI_Init(SPI_UNIT, &stcSpiInit);
  SPI_Cmd(SPI_UNIT, Enable);
}

void Spi_DmaConfig(void)
{
  stc_dma_config_t stcDmaCfg;

  MEM_ZERO_STRUCT(stcDmaCfg);

  PWC_Fcg0PeriphClockCmd(SPI_DMA_CLOCK_UNIT, Enable);
  PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_AOS, Enable);

  /* Configure TX DMA */
  stcDmaCfg.u16BlockSize = 1u;
  stcDmaCfg.u16TransferCnt = 1;
  stcDmaCfg.u32SrcAddr = static_cast<uint32_t>(0);
  stcDmaCfg.u32DesAddr = reinterpret_cast<uint32_t>(&SPI_UNIT->DR);
  stcDmaCfg.stcDmaChCfg.enSrcInc = AddressIncrease;
  stcDmaCfg.stcDmaChCfg.enDesInc = AddressFix;
  stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
  stcDmaCfg.stcDmaChCfg.enIntEn = Disable;
  DMA_InitChannel(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, &stcDmaCfg);

  DMA_SetTriggerSrc(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, SPI_DMA_TX_TRIG_SOURCE);

  /* Enable DMA. */
  DMA_Cmd(SPI_DMA_UNIT, Enable);
}

void spi_write_byte(const uint8_t byte)
{
  while (Reset == SPI_GetFlag(SPI_UNIT, SpiFlagSendBufferEmpty))
  {
  }
  /* Send data */
  SPI_SendData8(SPI_UNIT, byte);
}

void spi_dma_push(const void *data, const uint32_t size)
{
  DMA_Cmd(SPI_DMA_UNIT, Disable);
  SPI_Cmd(SPI_UNIT, Disable);
  DMA_SetSrcAddress(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, reinterpret_cast<uint32_t>(data));
  DMA_SetTransferCnt(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, size);

  DMA_Cmd(SPI_DMA_UNIT, Enable);
  DMA_ChannelCmd(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, Enable);

  LCD_CS_CLR;
  LCD_RS_SET;
  SPI_Cmd(SPI_UNIT, Enable);
  while (Reset == DMA_GetIrqFlag(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, TrnCpltIrq))
  {
  }
  DMA_ClearIrqFlag(SPI_DMA_UNIT, SPI_DMA_TX_CHANNEL, TrnCpltIrq);
}
